Router>en
Router#config ter
Router#config terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)# interface g0/0/0
Router(config-if)# no shutdown

Router(config-if)# interface g0/0/0.10
Router(config-subif)# encapsulation dot1Q 10
Router(config-subif)# ip address 192.168.10.1 255.255.255.0
Router(config-subif)# ip nat inside
Router(config-subif)# no shutdown 
Router(config-subif)# interface g0/0/0.20
Router(config-subif)# encapsulation dot1Q 20
Router(config-subif)# ip address 192.168.20.1 255.255.255.0
Router(config-subif)# no shutdown
Router(config-subif)# ip nat inside  
Router(config-subif)# exit
%LINK-5-CHANGED: Interface GigabitEthernet0/0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0, changed state to up

%LINK-5-CHANGED: Interface GigabitEthernet0/0/0.10, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0.10, changed state to up

%LINK-5-CHANGED: Interface GigabitEthernet0/0/0.20, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0.20, changed state to up

Router(config)#ip dhcp pool ccna
Router(dhcp-config)# network 192.168.10.1 255.255.255.0
Router(dhcp-config)# default-router 192.168.10.1
Router(dhcp-config)# dns-server 8.8.8.8
Router(dhcp-config)# exit
Router(config)# ip dhcp pool ccnp
Router(dhcp-config)# network 192.168.20.1 255.255.255.0
Router(dhcp-config)# default-router 192.168.20.1
Router(dhcp-config)# dns-server 8.8.8.8
Router(dhcp-config)#exit
Router(config)#%DHCPD-4-PING_CONFLICT: DHCP address conflict:  server pinged 192.168.10.1.
%DHCPD-4-PING_CONFLICT: DHCP address conflict:  server pinged 192.168.20.1.
%DHCPD-4-PING_CONFLICT: DHCP address conflict:  server pinged 192.168.20.1.

Router(config)# ip route 0.0.0.0 0.0.0.0 10.17.35.254
Router(config)# ip nat pool nat 10.17.35.252 10.17.35.252 netmask 255.255.255.0
Router(config)# access-list 1 permit any
Router(config)# ip nat inside source list 1 pool nat overload 
Router(config)# interface GigabitEthernet0/0/0
Router(config-if)# exit
Router(config)#
Router(config)#
Router(config)#interface Serial0/1/0
Router(config-if)#ip address 10.17.35.253 255.0.0.0
Router(config-if)#ip address 10.17.35.253 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#
%LINK-5-CHANGED: Interface Serial0/1/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/1/0, changed state to up
ip nat outs
Router(config-if)#ip nat outside 
Router(config-if)#
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#show ip nat t
Router#show ip nat translations 
Pro  Inside global     Inside local       Outside local      Outside global
tcp 10.17.35.252:1024  192.168.10.4:1026  192.168.30.2:80    192.168.30.2:80
tcp 10.17.35.252:1025  192.168.20.3:1026  192.168.30.2:80    192.168.30.2:80
tcp 10.17.35.252:1026  192.168.10.3:1026  192.168.30.2:80    192.168.30.2:80
tcp 10.17.35.252:1027  192.168.20.2:1027  192.168.30.2:80    192.168.30.2:80
tcp 10.17.35.252:1028  192.168.20.4:1026  192.168.30.2:80    192.168.30.2:80
tcp 10.17.35.252:1034  192.168.10.2:1034  192.168.30.2:80    192.168.30.2:80
Switch(config)#vlan 10
Switch(config-vlan)# name SALES
Switch(config-vlan)# vlan 20
Switch(config-vlan)# name ADMIN
Switch(config-vlan)# interface range fastEthernet 0/2-4
Switch(config-if-range)# switchport mode access
Switch(config-if-range)# switchport access vlan 10
Switch(config-if-range)#
Switch(config-if-range)# interface range fastEthernet 0/5-7
Switch(config-if-range)# switchport mode access
Switch(config-if-range)# switchport access vlan 20
Switch(config-if-range)# interface fastEthernet 0/1
Switch(config-if)# switchport mode trunk
Switch(config-if)# switchport trunk allowed vlan 10,20
Switch(config-if)#
Router#config ter
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname zerin
zerin(config)#ip domain cisco.com
                        ^
% Invalid input detected at '^' marker.
	
zerin(config)#ip do
zerin(config)#ip domain
zerin(config)#ip domain-name cisco
zerin(config)#cry
zerin(config)#crypto key ge
zerin(config)#crypto key generate rsa
The name for the keys will be: zerin.cisco
Choose the size of the key modulus in the range of 360 to 2048 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 1024
% Generating 1024 bit RSA keys, keys will be non-exportable...[OK]

zerin(config)#enable pas
*Mar 1 0:15:11.327: %SSH-5-ENABLED: SSH 1.99 has been enabled
zerin(config)#enable password ccna2201
zerin(config)#user
zerin(config)#username saima pas
zerin(config)#username saima password zerin
zerin(config)#line vty 0 4
zerin(config-line)#tr
zerin(config-line)#transport input ssh
zerin(config-line)#login local
zerin(config-line)#